[
  {
    "plantId": 1,
    "plantName": "Snake Plant",
    "category": "Air Purifier",
    "price": 18,
    "rating": 4.8,
    "availableStock": 10,
    "careLevel": "Easy",
    "description": "The Snake Plant, also known as Sansevieria, is a timeless indoor classic loved for its tall, sword-like leaves and unmatched durability. It’s one of the best air-purifying plants, filtering out toxins like formaldehyde and benzene, and releases oxygen even at night. Perfect for bedrooms, offices, and low-light spaces, it thrives with little water and attention. Its sleek, architectural form also adds a modern, minimalist touch to any interior.",
    "image": "https://images.pexels.com/photos/3076899/pexels-photo-3076899.jpeg?_gl=1*1ta6zqh*_ga*MTAxOTI5NTkwNy4xNzUxNDYwMzc0*_ga_8JE65Q40S6*czE3NjExNTc4MDEkbzMkZzEkdDE3NjExNTc4MTQkajQ3JGwwJGgw",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 2,
    "plantName": "ZZ Plant",
    "category": "Low Light",
    "price": 22,
    "rating": 4.7,
    "availableStock": 7,
    "careLevel": "Easy",
    "description": "The ZZ Plant, short for Zamioculcas zamiifolia, is one of the most forgiving houseplants you can own. Its glossy, deep green leaves stay vibrant even in dimly lit rooms, making it a favorite for homes and offices with limited natural light. It stores water in its rhizomes, allowing it to survive long dry periods without drooping. Virtually pest-free and resilient to neglect, the ZZ Plant symbolizes prosperity and endurance while bringing a touch of natural sophistication indoors.",
    "image": "https://images.pexels.com/photos/3076897/pexels-photo-3076897.jpeg?_gl=1*17y2hoo*_ga*MTAxOTI5NTkwNy4xNzUxNDYwMzc0*_ga_8JE65Q40S6*czE3NjExNTc4MDEkbzMkZzEkdDE3NjExNTc4ODQkajQ3JGwwJGgw",
    "providerName": "GreenCorner"
  },
  {
    "plantId": 3,
    "plantName": "Monstera Deliciosa",
    "category": "Focal Plant",
    "price": 45,
    "rating": 4.9,
    "availableStock": 4,
    "careLevel": "Medium",
    "description": "Monstera Deliciosa, often called the Swiss Cheese Plant, is admired worldwide for its stunning split leaves that give any space a bold tropical vibe. Native to Central America’s rainforests, it grows beautifully in bright, indirect light and appreciates occasional misting for humidity. Each new leaf unfurls with unique perforations that symbolize growth and vitality. Perfect for living rooms or studios, this plant turns ordinary spaces into lush indoor jungles while improving air quality naturally.",
    "image": "https://images.pexels.com/photos/3153522/pexels-photo-3153522.jpeg?_gl=1*1bmld5c*_ga*MTAxOTI5NTkwNy4xNzUxNDYwMzc0*_ga_8JE65Q40S6*czE3NjExNTc4MDEkbzMkZzEkdDE3NjExNTc5NDAkajU5JGwwJGgw",
    "providerName": "Leaf & Co"
  },
  {
    "plantId": 4,
    "plantName": "Pothos Marble Queen",
    "category": "Trailing",
    "price": 15,
    "rating": 4.6,
    "availableStock": 15,
    "careLevel": "Easy",
    "description": "The Pothos Marble Queen is a trailing masterpiece with stunning white and green variegated leaves that effortlessly cascade down shelves and hanging pots. Known for its air-purifying properties and adaptability, it can thrive in both bright and low-light conditions. It grows rapidly, making it perfect for beginners who want quick, lush results. This easygoing plant adds a soft, natural aesthetic to your space while requiring minimal care—just occasional watering and indirect light to stay happy and healthy.",
    "image": "https://images.pexels.com/photos/6913494/pexels-photo-6913494.jpeg?_gl=1*1t97oeq*_ga*MTAxOTI5NTkwNy4xNzUxNDYwMzc0*_ga_8JE65Q40S6*czE3NjExNTc4MDEkbzMkZzEkdDE3NjExNTgwMzIkajQwJGwwJGgw",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 5,
    "plantName": "Fiddle Leaf Fig",
    "category": "Statement",
    "price": 60,
    "rating": 4.4,
    "availableStock": 2,
    "careLevel": "Hard",
    "description": "The Fiddle Leaf Fig is the ultimate statement plant, boasting large, violin-shaped leaves that instantly elevate any modern home interior. Native to West Africa, it thrives in bright, indirect light and needs consistent watering with proper drainage. While a bit temperamental, it rewards dedicated owners with majestic growth and an architectural presence. Its bold form and lush foliage make it a favorite among designers who seek to bring tropical grandeur and natural elegance into urban living spaces.",
    "image": "https://images.pexels.com/photos/5726035/pexels-photo-5726035.jpeg?_gl=1*1qwjso3*_ga*MTAxOTI5NTkwNy4xNzUxNDYwMzc0*_ga_8JE65Q40S6*czE3NjExNTc4MDEkbzMkZzEkdDE3NjExNTgxMjIkajMwJGwwJGgw",
    "providerName": "Leaf & Co"
  },
  {
    "plantId": 6,
    "plantName": "Peace Lily",
    "category": "Flowering",
    "price": 20,
    "rating": 4.5,
    "availableStock": 9,
    "careLevel": "Medium",
    "description": "The Peace Lily is an elegant flowering houseplant known for its rich green leaves and signature white blooms that symbolize tranquility and harmony. It thrives in warm, humid environments with indirect light and blooms multiple times a year with the right care. Beyond its beauty, it’s also one of NASA’s top-rated air purifiers, removing toxins from indoor air. A perfect gift of peace and purity, this plant adds a touch of serenity to bedrooms, offices, and cozy corners.",
    "image": "https://images.pexels.com/photos/7655913/pexels-photo-7655913.jpeg?_gl=1*yu8299*_ga*MTAxOTI5NTkwNy4xNzUxNDYwMzc0*_ga_8JE65Q40S6*czE3NjExNTc4MDEkbzMkZzEkdDE3NjExNTgyMDUkajE2JGwwJGgw",
    "providerName": "GreenCorner"
  }
]